# DATA FILTERING

##### 01/02/2024

##### M.Abdirisak.A

In [30]:
import pandas as pd
import numpy as np

In [31]:
students={
    'NAME':["ADEN A","MAINA J","GOLD K","FARO D","QURASHA H "," CESS M","PAULO M","DENA B","MAINA L","MOHAMED A"],
    'UNIT':["HIV","EDA","TOE","CBA","RM","RM","SP","LP","TOH","CS"],
    'SCORE':np.random.uniform(40,100,10),
    'loc_area':["SHALOM","RUNDA","MKU","TATU","MAKONGENI","TATU","MKU","RUNDA","YMCA","YMCA"]
    
}
df=pd.DataFrame(students)

In [32]:
df

         NAME UNIT      SCORE   loc_area
0      ADEN A  HIV  70.936518     SHALOM
1     MAINA J  EDA  58.658122      RUNDA
2      GOLD K  TOE  85.005427        MKU
3      FARO D  CBA  89.269842       TATU
4  QURASHA H    RM  79.300707  MAKONGENI
5      CESS M   RM  65.663859       TATU
6     PAULO M   SP  75.870339        MKU
7      DENA B   LP  41.241150      RUNDA
8     MAINA L  TOH  70.538329       YMCA
9   MOHAMED A   CS  89.273558       YMCA

In [67]:
df.shape

(10, 4)

### Logical Operation

In [33]:
# it is used on column values to filter row values
# this will gives us those whose score is less than 80
df[df.SCORE<80]

         NAME UNIT      SCORE   loc_area
0      ADEN A  HIV  70.936518     SHALOM
1     MAINA J  EDA  58.658122      RUNDA
4  QURASHA H    RM  79.300707  MAKONGENI
5      CESS M   RM  65.663859       TATU
6     PAULO M   SP  75.870339        MKU
7      DENA B   LP  41.241150      RUNDA
8     MAINA L  TOH  70.538329       YMCA

In [34]:
# it can also be used on strings
# this will gives thise those local area is Runda
df[df.loc_area=="RUNDA"]

      NAME UNIT      SCORE loc_area
1  MAINA J  EDA  58.658122    RUNDA
7   DENA B   LP  41.241150    RUNDA

### Multiple  Logical Operators

In [38]:
# logical AND(&)
df[(df.loc_area=="YMCA") & (df.SCORE>50)]

        NAME UNIT      SCORE loc_area
8    MAINA L  TOH  70.538329     YMCA
9  MOHAMED A   CS  89.273558     YMCA

In [42]:
# logical OR(|)
df[(df.NAME=="FARO D" ) |(df.loc_area=="TATU")]

      NAME UNIT      SCORE loc_area
3   FARO D  CBA  89.269842     TATU
5   CESS M   RM  65.663859     TATU

### isin() Method

In [51]:
# isin() it can be used to filter elements in a lists
NAMES=["FARO D","MAINA L","MOHAMED A"]
df[df.NAME.isin(NAMES)]

        NAME UNIT      SCORE loc_area
3     FARO D  CBA  89.269842     TATU
8    MAINA L  TOH  70.538329     YMCA
9  MOHAMED A   CS  89.273558     YMCA

### String Accessor

In [53]:
# srt accessor it is very helpful when filtering rows and columns
# it can also selects names that start a certain latter
df[df.UNIT.str.startswith("T")]

      NAME UNIT      SCORE loc_area
2   GOLD K  TOE  85.005427      MKU
8  MAINA L  TOH  70.538329     YMCA

In [54]:
# contains() returns values that contain in a set
df[df.UNIT.str.contains('S')]

        NAME UNIT      SCORE loc_area
6    PAULO M   SP  75.870339      MKU
9  MOHAMED A   CS  89.273558     YMCA

##### Tild(~)

In [57]:
# this is not logic operator i
# this gives names that do not contain letter A
df[~df.NAME.str.contains('A')]

      NAME UNIT      SCORE loc_area
2   GOLD K  TOE  85.005427      MKU
5   CESS M   RM  65.663859     TATU

##### Query()

In [69]:
# allows one to query the dataframe
df.query('loc_area=="TATU" and SCORE>60')

      NAME UNIT      SCORE loc_area
3   FARO D  CBA  89.269842     TATU
5   CESS M   RM  65.663859     TATU

##### nlargest & nsmallest

In [62]:
# this function gives the largest value a column(score)
df.nlargest(3, "SCORE")

        NAME UNIT      SCORE loc_area
9  MOHAMED A   CS  89.273558     YMCA
3     FARO D  CBA  89.269842     TATU
2     GOLD K  TOE  85.005427      MKU

In [66]:
# this function gives smallest a column(score)
df.nsmallest(3, "SCORE")

      NAME UNIT      SCORE loc_area
7   DENA B   LP  41.241150    RUNDA
1  MAINA J  EDA  58.658122    RUNDA
5   CESS M   RM  65.663859     TATU

##### Loc and Iloc

In [114]:
#loc fillters columns and row using labels
# iloc filters columns and rows using index
df.iloc[3:7]

           NAME UNIT      SCORE   loc_area
IV       FARO D  CBA  89.269842       TATU
V    QURASHA H    RM  79.300707  MAKONGENI
VI       CESS M   RM  65.663859       TATU
VII     PAULO M   SP  75.870339        MKU

In [110]:
# we index to differentiate between loc and iloc
df.index=['I','II','III','IV','V','VI','VII','VIII','IX','X']
df

            NAME UNIT      SCORE   loc_area
I         ADEN A  HIV  70.936518     SHALOM
II       MAINA J  EDA  58.658122      RUNDA
III       GOLD K  TOE  85.005427        MKU
IV        FARO D  CBA  89.269842       TATU
V     QURASHA H    RM  79.300707  MAKONGENI
VI        CESS M   RM  65.663859       TATU
VII      PAULO M   SP  75.870339        MKU
VIII      DENA B   LP  41.241150      RUNDA
IX       MAINA L  TOH  70.538329       YMCA
X      MOHAMED A   CS  89.273558       YMCA

In [111]:
df.loc['IV']

NAME           FARO D
UNIT              CBA
SCORE       89.269842
loc_area         TATU
Name: IV, dtype: object